Documents/УстановкаТарифовКомандировочных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаТарифовКомандировочных</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТарифыКомандировочных</xr:Item>
				<xr:Item>CalculationRegister.Удержания</xr:Item>
				<xr:Item>AccumulationRegister.НалогиПоЗаработнойПлате</xr:Item>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОднаСтрана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдинГород</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тарифы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Суточные</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Питание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проживание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проездные</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыТарифовКомандировочных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыТарифовКомандировочных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Суточные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Питание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проездные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаТарифовКомандировочных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаТарифы(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТ_Шапка.Период,
		|	ВТ_Шапка.Организация,
		|	ВременнаяТаблицаТарифыКомандировочных.Страна,
		|	ВременнаяТаблицаТарифыКомандировочных.Город,
		|	ВременнаяТаблицаТарифыКомандировочных.Валюта,
		|	ВременнаяТаблицаТарифыКомандировочных.Суточные КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыТарифовКомандировочных.Суточные) КАК ВидТарифаКомандировочных
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВТ_Шапка,
		|	ВременнаяТаблицаТарифыКомандировочных КАК ВременнаяТаблицаТарифыКомандировочных
		|ГДЕ
		|	ВременнаяТаблицаТарифыКомандировочных.Суточные <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Шапка.Период,
		|	ВТ_Шапка.Организация,
		|	ВременнаяТаблицаТарифыКомандировочных.Страна,
		|	ВременнаяТаблицаТарифыКомандировочных.Город,
		|	ВременнаяТаблицаТарифыКомандировочных.Валюта,
		|	ВременнаяТаблицаТарифыКомандировочных.Питание,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыТарифовКомандировочных.Питание)
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВТ_Шапка,
		|	ВременнаяТаблицаТарифыКомандировочных КАК ВременнаяТаблицаТарифыКомандировочных
		|ГДЕ
		|	ВременнаяТаблицаТарифыКомандировочных.Питание <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Шапка.Период,
		|	ВТ_Шапка.Организация,
		|	ВременнаяТаблицаТарифыКомандировочных.Страна,
		|	ВременнаяТаблицаТарифыКомандировочных.Город,
		|	ВременнаяТаблицаТарифыКомандировочных.Валюта,
		|	ВременнаяТаблицаТарифыКомандировочных.Проживание,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыТарифовКомандировочных.Проживание)
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВТ_Шапка,
		|	ВременнаяТаблицаТарифыКомандировочных КАК ВременнаяТаблицаТарифыКомандировочных
		|ГДЕ
		|	ВременнаяТаблицаТарифыКомандировочных.Проживание <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Шапка.Период,
		|	ВТ_Шапка.Организация,
		|	ВременнаяТаблицаТарифыКомандировочных.Страна,
		|	ВременнаяТаблицаТарифыКомандировочных.Город,
		|	ВременнаяТаблицаТарифыКомандировочных.Валюта,
		|	ВременнаяТаблицаТарифыКомандировочных.Проездные,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыТарифовКомандировочных.Проездные)
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВТ_Шапка,
		|	ВременнаяТаблицаТарифыКомандировочных КАК ВременнаяТаблицаТарифыКомандировочных
		|ГДЕ
		|	ВременнаяТаблицаТарифыКомандировочных.Проживание <> 0";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТарифыКомандировочных", РезультатЗапроса.Выгрузить());
КонецПроцедуры // СформироватьТаблицаСотрудники()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УстановкаТарифовКомандировочных.Ссылка,
		|	УстановкаТарифовКомандировочных.ВерсияДанных,
		|	УстановкаТарифовКомандировочных.ПометкаУдаления,
		|	УстановкаТарифовКомандировочных.Номер,
		|	УстановкаТарифовКомандировочных.Дата КАК Период,
		|	УстановкаТарифовКомандировочных.Проведен,
		|	УстановкаТарифовКомандировочных.Организация КАК Организация,
		|	УстановкаТарифовКомандировочных.Комментарий,
		|	УстановкаТарифовКомандировочных.Автор,
		|	УстановкаТарифовКомандировочных.Страна,
		|	УстановкаТарифовКомандировочных.Город,
		|	УстановкаТарифовКомандировочных.ОднаСтрана,
		|	УстановкаТарифовКомандировочных.ОдинГород
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.УстановкаТарифовКомандировочных КАК УстановкаТарифовКомандировочных
		|ГДЕ
		|	УстановкаТарифовКомандировочных.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаТарифовКомандировочныхТарифы.Ссылка,
		|	УстановкаТарифовКомандировочныхТарифы.НомерСтроки,
		|	УстановкаТарифовКомандировочныхТарифы.Страна,
		|	УстановкаТарифовКомандировочныхТарифы.Город,
		|	УстановкаТарифовКомандировочныхТарифы.Суточные,
		|	УстановкаТарифовКомандировочныхТарифы.Питание,
		|	УстановкаТарифовКомандировочныхТарифы.Проживание,
		|	УстановкаТарифовКомандировочныхТарифы.Проездные,
		|	УстановкаТарифовКомандировочныхТарифы.Валюта
		|ПОМЕСТИТЬ ВременнаяТаблицаТарифыКомандировочных
		|ИЗ
		|	Документ.УстановкаТарифовКомандировочных.Тарифы КАК УстановкаТарифовКомандировочныхТарифы
		|ГДЕ
		|	УстановкаТарифовКомандировочныхТарифы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Выполнить();
	
	СформироватьТаблицаТарифы(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#КонецЕсли
